class Code():
    def cabinCode(__name__):
        code_dir = {
            'A': '头等舱免折、常旅客免票',
            'C': '公务舱公布价',
            'D': '公务舱免折、常旅客免票',
            'Y': '普通舱（经济舱）公布价',
            'S': '联程、缺口程等特殊舱位',
            'B': '普通舱9折',
            'H': '普通舱85折',
            'K': '普通舱80折',
            'L': '普通舱75折',
            'M': '普通舱70折',
            'N': '普通舱65折',
            'Q': '普通舱60折（含教师、医护人员、县级（含）以上劳模）',
            'T': '普通舱55折',
            'X': '普通舱50折（含学生、长者（年满55周岁的中国大陆公民））',
            'U': '普通舱45折',
            'E': '普通舱40折',
            'W': '普通舱35折',
            'R': '普通舱30折',
            'O': '普通舱25折',
            'Z': '代码共享留座专用舱',
            'V': '常旅客专用舱（国航知音卡旅客订座）',
            'G': '普通舱免折和常旅客免票',
        }
        return code_dir

    def cityCode(__name__):
        code_dir = {"厦门": "XMN", "哈尔滨": "HRB"}
        return code_dir
